docs/philosophy.md
- [Table Of Contents](#orgc9d397d)
- [Overview](#org850df8b)
- [The law of Karma (the Causality principle)](#orgb51ac78)
- [The Buddha](#org13bdce8)
  - [The principle of dependent origination](#org15fb458)
  - [Everything is &ldquo;compound&rdquo;](#org2d804f4)
  - [Nothing is permanent](#org6f9df4f)
  - [Non-Self (no Atman, only Brahman)](#org5b7a448)
  - [Everything is suffering](#org1d56bc7)
- [Contradictions do not exist](#org858a65c)
- [Not everything is possible](#org7cb7688)
- [Everything is fully-deterministic](#org43c6c14)
- [Stochastic and randomness](#orgaf99822)
- [Mental shortcuts](#org8422a95)



<a id="orgc9d397d"></a>

# Table Of Contents     :TOC:

-   
-   
-   -   
    -   
    -   
    -   
    -
-   
-   
-   
-   
-   


<a id="org850df8b"></a>

# Overview

*&ldquo;To see things as they [really] are&rdquo;* is the summary of *any* proper philosophy, including the Upanishadic &ldquo;philosophy of the mind&rdquo;.

Seeing what isn&rsquo;t &ldquo;out there&rdquo; (and especially ignoring *What Is*) is an inevitable cause of suffering (having an inadequate &ldquo;state&rdquo; or conditions of the mind or body).

We need the [only] proper philosophy to apply *statistical and scientific methods* properly.


<a id="orgb51ac78"></a>

# The law of Karma (the Causality principle)

People captured this principle in many forms (looking at *the same mountain* from different points of view and angles).

-   *The Universal aw of Karma*
-   *Dependent Origination* (of the Buddha)
-   even The *Modus Ponens*


<a id="org13bdce8"></a>

# The Buddha


<a id="org15fb458"></a>

## The principle of dependent origination

> When this is, that is. From the arising of this comes the arising of that. When this isn&rsquo;t, that isn&rsquo;t. From the cessation of this comes the cessation of that.


<a id="org2d804f4"></a>

## Everything is &ldquo;compound&rdquo;

This is principle of the Buddha is often overlooked. The modern formulation would be *&ldquo;everything is a process&rdquo;* &#x2013; this is so profound.


<a id="org6f9df4f"></a>

## Nothing is permanent

Whatever came together will [eventually] fall apart &#x2013; the property of anything &ldquo;compound&rdquo;.


<a id="org5b7a448"></a>

## Non-Self (no Atman, only Brahman)

We are *That*, but not *this* (imaginary) That &#x2013; that (actual) *That*.


<a id="org1d56bc7"></a>

## Everything is suffering

This is just a direct consequence of the principles above.


<a id="org858a65c"></a>

# Contradictions do not exist

This is, by far, the second most important principle.

According to the [unfolding] nature of the Universe, contradictions do not exist (they never arise, in principle &#x2013; everything is caused by the prior states of the same Universe).

When you face a contradiction &#x2013; check your premises, at least one of them *will* be wrong.

This is what they call a &ldquo;reality check&rdquo;.


<a id="org7cb7688"></a>

# Not everything is possible

&ldquo;Everything is possible&rdquo; is just another meme of the liberal arts &ldquo;education&rdquo;.

This is related to a &ldquo;pure probabilistic&rdquo; view of reality, which is another cathedral of unnecessary and redundant abstractions.

Possibilities are *scooped* (literally) by the prior states of the universe in a particular locality.

Once a river began to develop its canyon, it won&rsquo;t flow in any other direction (because a canyon is a [second order] process of its own &#x2013; it is a drainage for the whole region).

Once a tree starts to develop a branch, it will be there, and other sub-branches may arise from it, and so on.


<a id="org43c6c14"></a>

# Everything is fully-deterministic

But not *pre-determined*. It simply can&rsquo;t be.

The &ldquo;causes&rdquo; are unfolding (developing) &ldquo;in parallel&rdquo; at many levels &#x2013; so-called *micro-* and *macro-* levels, and not even &ldquo;out there&rdquo; *yet*.

The new ones rise, the old ones diminish or even cease, leave or enter this particular *locality*.

A drunken driver is still drinking, or even working out his way to get drunk.


<a id="orgaf99822"></a>

# Stochastic and randomness

&ldquo;Stochastic&rdquo; just means that the actual underlying causality (for a process) is too complicated, too subtle or too fleeting to grasp (to properly capture).

The causes of every raining (in every particular locality) are of the same nature, but always of different (never exactly the same) *magnitudes*.

It does not mean that things are &ldquo;random&rdquo;. The notion of &ldquo;randomness&rdquo; is an abstract mathematical concept and does not exist anywhere else.

&ldquo;Possibilities&rdquo; are *bound by What Is* (in more than one way).


<a id="org8422a95"></a>

# Mental shortcuts

When an observed phenomena is too complex to grasp, the mind tends to develop and use so-called &ldquo;mental shortcuts&rdquo; or &ldquo;naive heuristics&rdquo;, which are &ldquo;all wrong (inaccurate) but occasionally useful&rdquo;.

Notice that this *is not* *&ldquo;A Map Is Not The Territory&rdquo;* principle. A correct map &#x2013; the one which corresponds to (or partially captures) *What Is* &#x2013; is always useful, however &ldquo;primitive&rdquo;.

Mental shortcuts can be arbitrary delusional. This is how memes come to be.
